function changeDescription(serviceType) {
    const title = document.getElementById('description-title');
    const text = document.getElementById('description-text');

    // Update title and description based on clicked image
    if (serviceType === 'premium') {
        title.innerText = 'Премиум качествени панели';
        text.innerText = 'Ние използваме само най-качествените слънчеви панели, проектирани за оптимална ефективност и дълготрайна работа. Всички наши продукти са подкрепени от 25-годишна гаранция, което гарантира надеждност и спокойствие за нашите клиенти.';
    } else if (serviceType === 'install') {
        title.innerText = 'Експертни инсталации';
        text.innerText = 'Проследявайте производството на енергия в реално време с нашата интелигентна система, която предоставя детайлни анализи, персонализирани отчети и прогнози. Лесно наблюдавайте ефективността на вашата соларна инсталация и оптимизирайте използването на енергия за по-ниски разходи и по- висока ефективност.';
    } else if (serviceType === 'monitor') {
        title.innerText = 'Интелигентно наблюдение';
        text.innerText = 'Ние използваме само най-качествените слънчеви панели, проектирани за оптимална ефективност и дълготрайна работа. Всички наши продукти са подкрепени от 25-годишна гаранция, което гарантира надеждност и спокойствие за нашите клиенти.';
    }
}

